x1 = int(input("Введите координату x первой точки: "))
y1 = int(input("Введите координату y первой точки: "))
x2 = int(input("Введите координату x второй точки: "))
y2 = int(input("Введите координату y второй точки: "))

if x1>0 and y1>0 and x2>0 and y2>0:
    print('Обе точки лежат в 1 четвертти')
elif x1<0 and y1>0 and x2<0 and y2<0:
    print("Обе точки лежат в 2 четверти")
elif x1<0 and y1<0 and x2<0 and y1<0:
    print("Обе точки лежат в 3 четверти")
elif x1>0 and y1<0 and x2>0 and y2<0:
    print("Обе точки лежат в 4 четверти")
else:
    print("Обе точки лежат в разных четвертях")